---
author: Kotaz
title: "C++: циклы и массивы"
date: 2023-11-03 00:00:00
description: "C++: циклы и массивы"
categories: ["courses"]
tags: ["C++"]
slug: cpp01
image: 00_placeholder.png
---

## For

Цикл `for` - это один из наиболее распространенных и удобных способов итерации в C++. Он позволяет вам выполнять повторяющиеся действия определенное количество раз или итерировать через последовательность элементов. Вот обзор синтаксиса и примеры использования цикла `for`.

### Синтаксис цикла for

```cpp
for (инициализация; условие; обновление) {
    // Тело цикла
}
```

- **Инициализация**: Этот блок выполняется один раз, в начале цикла. Он используется для инициализации переменных цикла.
- **Условие**: Это логическое выражение, которое проверяется перед каждой итерацией. Если условие истинно, цикл продолжает выполнение; в противном случае, он завершается.
- **Обновление**: Этот блок выполняется после каждой итерации и обычно используется для изменения переменных цикла.
- **Тело цикла**: Это блок кода, который будет выполняться в каждой итерации.

### Примеры

#### Пример 1: Цикл for для итерации от 1 до 5

```cpp
#include <iostream>

int main() {
    for (int i = 1; i <= 5; i++) {
        std::cout << "Итерация " << i << std::endl;
    }
    return 0;
}
```

```plaintext
Итерация 1
Итерация 2
Итерация 3
Итерация 4
Итерация 5
```

В этом примере цикл `for` выполняет тело цикла 5 раз, начиная с `i = 1`, и увеличивая `i` на 1 в каждой итерации.

#### Пример 4: Использование цикла for для суммирования чисел от 1 до 100

```cpp
#include <iostream>

int main() {
    int sum = 0;
    for (int i = 1; i <= 100; i++)
        sum += i;
    std::cout << "Сумма чисел от 1 до 100: " << sum << std::endl;
    return 0;
}
```

```plaintext
Сумма  чисел  от  1  до  100:  5050
```

Этот пример демонстрирует использование цикла `for` для суммирования чисел от 1 до 100.

### Задачи

1. **Сумма чисел**: Напишите программу, которая находит сумму всех чисел от 1 до N, где N - введенное пользователем число.
2. **Факториал**: Разработайте программу для вычисления факториала числа N, используя цикл `for`.
3. **Таблица умножения**: Создайте таблицу умножения для определенного числа, например, для числа 7, выводя результаты от 7 *1 до 7* 10.
4. **Подсчет четных чисел**: Напишите программу, которая подсчитывает количество четных чисел в диапазоне от M до N, где M и N - введенные пользователем значения.
5. **Рисование геометрических фигур**: Используйте цикл `for` для рисования геометрических фигур, таких как треугольники или квадраты, с заданными размерами.
6. **Работа с массивами**: Итерируйтесь по элементам массива и выполните определенные операции, такие как поиск среднего значения, нахождение максимального/минимального элемента и другие.
7. **Генерация последовательности чисел**: Создайте программу, которая генерирует последовательность чисел, например, все простые числа в определенном диапазоне.
8. **Таблица степеней двойки**: Выведите таблицу степеней двойки от 2^0 до 2^N.
9. **Подсчет гласных букв**: Подсчитайте количество гласных букв в строке, используя цикл `for`.

### Важные замечания

1. Инициализация, условие и обновление в цикле `for` могут быть любыми выражениями.
2. Переменные, объявленные в блоке инициализации, видны только в пределах цикла.
3. Если условие цикла всегда истинно, это приведет к бесконечному циклу.

Цикл `for` - мощный инструмент для итерации и выполнения повторяющихся действий в C++. Он может использоваться для различных задач, и вы можете настраивать его в соответствии с вашими потребностями.

## Цикл `while` и `do while`

### Цикл `while`

Цикл `while` выполняет блок кода, пока заданное условие остается истинным. Условие проверяется до выполнения блока кода, и если оно ложное с самого начала, блок кода ни разу не выполнится.

#### Пример `while`

```cpp
#include <iostream>

int main() {
    int i = 1;

    while (i <= 5) {
        std::cout << "Число " << i << std::endl;
        i++;
    }

    return 0;
}
```

```plaintext
Число 1
Число 2
Число 3
Число 4
Число 5
```

### Цикл `do-while`

Цикл `do-while` очень похож на `while`, но он гарантирует, что блок кода выполнится хотя бы один раз, даже если условие с самого начала ложное. Условие проверяется после выполнения блока кода.

#### Пример `do-while`

```cpp
#include <iostream>

int main() {
    int i = 1;

    do {
        std::cout << "Число " << i << std::endl;
        i++;
    } while (i <= 5);

    return 0;
}
```

```plaintext
Число 1
Число 2
Число 3
Число 4
Число 5
```

#### Задачи, решаемые и циклом `while`, и циклом `do-while`

1. **Сумма чисел**: Напишите программу для вычисления суммы чисел от 1 до N с использованием как цикла `while`, так и цикла `do-while`.
2. **Четные числа**: Выведите все четные числа от M до N с использованием как цикла `while`, так и цикла `do-while`.
3. **Проверка на простое число**: Напишите программу для определения, является ли число N простым, используя как цикл `while`, так и цикл `do-while`.

## Массивы

### Введение

**Массивы** - это одна из наиболее важных структур данных в программировании. Они представляют собой упорядоченный набор элементов одного типа, размещенных в памяти последовательно. Массивы позволяют хранить и обрабатывать множество данных одного типа, и они используются повсеместно в программировании, предоставляя доступ к данным в удобной форме.

Давайте рассмотрим аналогию из реальной жизни, чтобы лучше понять, как работают массивы. Представьте себе библиотеку, где книги хранятся на полках. Каждая книга имеет свой собственный номер, который указывает на ее местоположение. В этой аналогии:

- **Библиотека** - это массив, который содержит книги (элементы).
- **Полки** - это местоположение каждого элемента массива, которое определяется его индексом.
- **Номер книги** - это индекс элемента массива, с помощью которого мы можем найти и получить доступ к элементу.

В программировании массивы работают по аналогии с этой аналогией. Они позволяют нам хранить и управлять большими объемами данных. Массивы обладают следующими ключевыми характеристиками:

1. **Тип данных**: Все элементы массива должны быть одного и того же типа данных (например, целые числа, числа с плавающей запятой, символы и т. д.).
2. **Индексы**: Элементы массива упорядочены и доступ к ним осуществляется по индексам. Индексы начинаются с 0 (первый элемент) и увеличиваются на 1.
3. **Размер**: Массив имеет фиксированный размер, который определяется при его создании. Размер массива не может изменяться во время выполнения программы.
4. **Память**: Элементы массива располагаются последовательно в памяти, что обеспечивает быстрый доступ к данным.

### Операции над массивами

#### Объявление и инициализация массивов

Для создания массива в C++ вы должны указать его тип, имя и размер. Вот как это выглядит:

```cpp
тип_данных имя_массива[размер];
```

```cpp
int num[5];       // Объявление массива целых чисел размером 5
double values[10];  // Объявление массива чисел с плавающей запятой размером 10
char my_chars[26];     // Объявление массива символов размером 26
```

Вы можете инициализировать массив сразу при объявлении:

```cpp
int nums[] = {1, 2, 3, 4, 5};  // Инициализация массива целых чисел
```

### Доступ к элементам массива

Доступ к элементам массива осуществляется с использованием индекса, который указывает на конкретный элемент массива. Индексы начинаются с 0.

```cpp
int val = nums[2];  // Получение значения третьего элемента массива (индекс 2)
```

### Итерация по массиву

Чтобы пройти по всем элементам массива, вы можете использовать цикл, такой как `for` или `while`. Вот пример использования цикла `for`:

```cpp
for (int i = 0; i < 5; i++) {
    cout << числа[i] << " ";
}
```

### Задачи для практики

1. **Сумма элементов**: Напишите программу, которая вычисляет сумму всех элементов в массиве.
2. **Поиск максимума и минимума**: Найдите максимальный и минимальный элементы в массиве.
